; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	image0 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument7 image0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(have_image Star5 image0)
	(have_image Star6 image0)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 image0)
	(have_image Planet11 image1)
))

)

; plan
1. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 0 of 5
2. (calibrate satellite1 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 5
3. (turn_to satellite1 planet11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet11)
   goals met: 0 of 5
4. (take_image satellite1 planet11 instrument6 image1)
   added: (have_image planet11 image1)
   goals met: 1 of 5
5. (turn_to satellite1 phenomenon9 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 5
6. (take_image satellite1 phenomenon9 instrument6 image0)
   added: (have_image phenomenon9 image0)
   goals met: 2 of 5
7. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 5
8. (take_image satellite1 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 5
9. (turn_to satellite1 star5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star5)
   goals met: 3 of 5
10. (take_image satellite1 star5 instrument6 image0)
   added: (have_image star5 image0)
   goals met: 4 of 5
11. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 4 of 5
12. (take_image satellite1 star6 instrument6 image0)
   added: (have_image star6 image0)
   goals met: 5 of 5
